CREATE
DATABASE IF NOT EXISTS JavaDb;

USE
JavaDb;

CREATE TABLE students
(
    id          INT PRIMARY KEY AUTO_INCREMENT,
    firstName   VARCHAR(255) NOT NULL,
    lastName    VARCHAR(255) NOT NULL,
    patronymic  VARCHAR(255) NOT NULL,
    sex         INT          NOT NULL,
    dateOfBirth DATE         NOT NULL
);

INSERT INTO students (lastName, firstName, patronymic, sex, birthDate)
VALUES ('Бережний', 'Микита', 'Анатолійович', 1, '2000-01-01'),
       ('Болобов', 'Артем', 'Васильович', 1, '2002-02-10'),
       ('Гречук', 'Діана', 'Вадимівна', 2, '2001-03-18'),
       ('Димарьова', 'Марія', 'Костянтинівна', 2, '2003-04-20'),
       ('Заблуда', 'Максим', 'Євгенович', 1, '2002-03-15'),
       ('Карпенко', 'Іван', 'Сергійович', 1, '2001-08-09'),
       ('Корбань', 'Антон', 'Юрійович', 1, '2003-08-03'),
       ('Коротун', 'Сергій', 'Володимирович', 1, '2002-07-28'),
       ('Лєвін', 'Єгор', 'Геннадійович', 1, '2001-05-28'),
       ('Манахін', 'Михайло', 'Олександрович', 1, '2003-07-19'),
       ('Музичук', 'Денис', 'Сергійович', 1, '2002-10-09'),
       ('Ольховик', 'Дмитро', 'Володимирович', 1, '2001-3-7'),
       ('Пирогов', 'Олександр', 'Олександрович', 1, '2003-05-05'),
       ('Полісніченко', 'Тарас', 'Юрійович', 1, '2001-12-05'),
       ('Самойленко', 'Діана', 'Дмитрівна', 2, '2001-02-16'),
       ('Титаренко', 'Гліб', 'Олександрович', 1, '2003-11-14'),
       ('Топал', 'Данило', 'Романович', 1, '2002-09-21'),
       ('Трохименко', 'Валентин', 'Вікторович', 1, '2001-02-13'),
       ('Чекушкін', 'Нікіта', 'Дмитрович', 1, '2003-03-17'),
       ('Шаповалов', 'Євген', 'Вікторович', 1, '2000-11-14');